content.org
#+TITLE: CS 421 Web Content
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: lectures

** LL Parsing
:PROPERTIES:
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :type book
:EXPORT_FILE_NAME: ll-parsing
:END:

Need a parser but don't have a lot of time?  Maybe a recursive-descent parser
will do the trick.  LL parsers are simple, easy to write, and sometimes they even work
with the language you had in mind!

*** Videos

- [[/videos/ll-parsing][LL Parsing]]
- [[/videos/fixing-non-ll-grammars][Fixing Non-LL Grammars]]
- [[https://mediaspace.illinois.edu/media/t/1_a1af9qv3][SPring 2022 Class Session]]

*** Further Reading

- [[/handouts/ll-problems.pdf][Extra LL Problems]]  Here are more problems, with solutions at the end.
  We will not go over them formally in class, but feel free to ask about them if you want.

# - title: LL Activity (Spring 2021)
#   url: https://mediaspace.illinois.edu/media/1_q6au0u3i
# - title: LL Activity (Fall 2020)
#   url: https://mediaspace.illinois.edu/media/1_4308d5p1




